/*연습문제*/
/*
1. 다음 트리에 대한 중위 순회 결과는?
답 : D -> B -> A -> E -> C -> F (4번) 
*/

/*
2. 다음 트리를 전위 순회로 운행할 경우 다섯 번째로 탐색되는 것은?
A B D C E
E (2번)
*/ 

/*
3. 다음 그림과 같은 지니트리를 후위 순회한 결과는?
AB/ ... (4)
*/

/*
4. 다음 트리에서 단말 노드 수는?
D , G, H, F 4개 (3번)
*/

/*
5. 다음 그림에서 트리의 차수는?
답  : (1) 3

트리의 차수: 노드의 차수 중에서 가장 큰 값 
*/

/*
6. Y = A * B + C / D
답: (3)
*/ 

/*
7. 이진 트리에서 높이가 5일 때 이 트리는 최대 몇 개의 노드를 가질 수 있나.
높이 5
최대 노드의 수 : 2^5 - 1 = 31개 
답 : (4) 
*/

/*
8. NULL 포인터를 트리의 순회에 이용하는 트리를 무엇이라 하는가? 
(3) 스레드 이진 트리(threaded binary tree) 
*/

/*
9.
*/

/*
10. 다음의 이진트리에 대하여 다음 질문에 답하여라.
(1)위의 트리를 1차원 배열로 표현하시오.
NULL - 6 - 4 - 9 - 2 - 5 - 7 - 10 - 1 - 3 - NULL - NULL - NULL - NULL - 8 - 11

(2) 위의 트리를 전위 순회한 결과를 쓰시오.
6 - 4 - 2 - 1 - 3 - 5 - 9 - 7 - 10 - 8 - 11

(3) 위의 트리를 후위 순회한 결과를 쓰시오.
1 - 3 - 2 - 5 - 4 - 7 - 8 - 11 - 10 - 9 - 6

(4) 위의 트리를 중위 순회한 결과를 쓰시오.
1 - 2 - 3 - 4 - 5 - 6 - 7 - 9 - 8 - 10 - 11

(5) 위의 트리를 레벨 순회한 결과를 쓰시오.
6 - 4 - 9 - 2 - 5 - 7 - 10 - 1 - 3 - 8 - 11

(6) 위의 트리는 이진 탐색 트리인가? 그 이유는?
이진 탐색 트리가 아니다.
이진 탐색트리 조건 중 루트 노드의 오른쪽 서브트리는 루트보다 커야하는 조건이 있다.
하지만 8은 루트인 9보다 작은데 오른쪽에 있기 때문에  이 조건을 위배한다.
따라서 이진 탐색 트리가 아니다.
*/

/*
11. 다음 순서로 자료가 입력되었다고 가정하여 이진 탐색 트리를 생성하라. 
*/ 
